ext_Processing_Reports/src/ExternalDataProcessors/ВозвратОстатковИнтеркампани/ВозвратОстатковИнтеркампани.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ExternalDataProcessor>
  <name>ВозвратОстатковИнтеркампани</name>
  <attributes>
    <name>ДополнительнаяОбработкаСсылка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиЗагружены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоглашениеИнтеркампани</name>
    <comment>Параметр</comment>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСвойствоПриобретение</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Остатки</name>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Передано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМакс</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументПередачи</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ExternalDataProcessor>

ext_Processing_Reports/src/ExternalDataProcessors/ВозвратОстатковИнтеркампани/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СформироватьЗаголовокФормы(); 
	ЗагрузитьНастройки();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	ЗаписатьНастройкиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Направление = Направление * 86400;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОстатки

&НаКлиенте
Процедура ОстаткиКоличествоПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Остатки.ТекущиеДанные;
	Если ТекущиеДанные.Количество > ТекущиеДанные.КоличествоМакс Тогда
		ТекущиеДанные.Количество = ТекущиеДанные.КоличествоМакс;
		ПоказатьПредупреждение(, "Нельзя указывать количество больше чем кол-во по документу или остатка");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыборСнятьВсе(Команда)
	УстановитьПометку(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ВыборВсе(Команда)
	УстановитьПометку(Истина);
КонецПроцедуры

&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьЗаголовокФормы()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	СведенияОбработки = ОбработкаОбъект.СведенияОВнешнейОбработке();
	Заголовок = СтрШаблон("%1 v <%2>", СведенияОбработки.Наименование, СведенияОбработки.Версия);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(ЗначениеПометки)
	Для Каждого СтрокаОстатки Из Объект.Остатки Цикл
		СтрокаОстатки.Пометка = ЗначениеПометки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройки()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьНастройки();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗаписатьНастройки();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Обновить();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
	Объект.Остатки.Сортировать("Номенклатура,ДокументПередачи");
	Для Каждого СтрокаОстатки Из Объект.Остатки Цикл
		СтрокаОстатки.КоличествоМакс = Мин(СтрокаОстатки.Остаток, СтрокаОстатки.Передано);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.Обработать();
	ОбработкаОбъект.Обновить();
	ЗначениеВРеквизитФормы(ОбработкаОбъект, "Объект");
КонецПроцедуры

#КонецОбласти
